dataframeについて  
データ分析の肝  
データフレームは行と列で表現されるものでエクセルみたいな感じ

In [2]:
import pandas as pd
from IPython.display import display

In [4]:
#データフレームを作成するため2次元配列を作成する
val = [[1, 2, 3],[10, 20, 30]]

In [6]:
#dtypeはデータ型を指定することができる
df_val = pd.DataFrame(val, dtype=float)

display(df_val)

      0     1     2
0   1.0   2.0   3.0
1  10.0  20.0  30.0

In [7]:
#各列に対するデータ型を確認することができる
df_val.dtypes

0    float64
1    float64
2    float64
dtype: object

In [8]:
#列名と行名を指定する方法

#データフレームを作成するため2次元配列を作成する
val2 = [[10, 20, 30],[5, 2, 390]]


#index=で行名、columns=で列名を指定することができる
df_val2 = pd.DataFrame(val2, index=['r0', 'r1'], columns=['c0', 'c1', 'c2'])

display(df_val2)

    c0  c1   c2
r0  10  20   30
r1   5   2  390

In [9]:
#seriesをデータフレームにする
sr_age = pd.Series([23, 31, 49, 60])
sr_gender = pd.Series(['M', 'F', 'F', 'M'])
sr_height = pd.Series([175, 160, 156, 180])
sr_weight = pd.Series([65, 40, 48, 100])

In [10]:
#左にはつけたいカラム名で右に対象とするデータを指定してあげる
df_human = pd.DataFrame({
    'age' : sr_age,
    'gender' : sr_gender,
    'height' : sr_height,
    'weight' : sr_weight
})

display(df_human)

   age gender  height  weight
0   23      M     175      65
1   31      F     160      40
2   49      F     156      48
3   60      M     180     100

In [13]:
#欠損値の確認について


#新たにseriesをデータフレームにするためのやつを作っておく
sr_age = pd.Series([23, 31, 49, 60], index=['sato', 'yamada', 'suzuki', 'tanaka'])
sr_gender = pd.Series(['M', 'F', 'M'], index=['sato', 'yamada', 'suzuki'])
sr_height = pd.Series([175, 156, 180], index=['sato', 'yamada', 'tanaka'])
sr_weight = pd.Series([65, 40], index=['sato', 'tanaka'])

In [14]:
#左にはつけたいカラム名で右に対象とするデータを指定してあげる
df_human = pd.DataFrame({
    'age' : sr_age,
    'gender' : sr_gender,
    'height' : sr_height,
    'weight' : sr_weight
})

display(df_human)
#indexが人の名前になっている
#データのない部分は欠損値になっている

        age gender  height  weight
sato     23      M   175.0    65.0
suzuki   49      M     NaN     NaN
tanaka   60    NaN   180.0    40.0
yamada   31      F   156.0     NaN

### データフレームの参照について

In [15]:
#データフレームの参照について


#新たにseriesをデータフレームにするためのやつを作っておく
sr_age2 = pd.Series([23, 31, 49, 60], index=['sato', 'yamada', 'suzuki', 'tanaka'])
sr_gender2 = pd.Series(['M', 'F', 'M'], index=['sato', 'yamada', 'suzuki'])
sr_height2 = pd.Series([175, 156, 180], index=['sato', 'yamada', 'tanaka'])
sr_weight2 = pd.Series([65, 40], index=['sato', 'tanaka'])

In [16]:
#左にはつけたいカラム名で右に対象とするデータを指定してあげる
df_human2 = pd.DataFrame({
    'age' : sr_age2,
    'gender' : sr_gender2,
    'height' : sr_height2,
    'weight' : sr_weight2
})

display(df_human2)
#indexが人の名前になっている
#データのない部分は欠損値になっている

        age gender  height  weight
sato     23      M   175.0    65.0
suzuki   49      M     NaN     NaN
tanaka   60    NaN   180.0    40.0
yamada   31      F   156.0     NaN

In [17]:
#データフレームの行数と列数を確認する
df_human2.shape

(4, 4)

In [18]:
#行数だけを見るとき
df_human2.shape[0]

4

In [19]:
#列数だけを見るとき
df_human2.shape[1]

4

In [20]:
#データフレームの全要素を確認する
df_human2.size

16

In [21]:
#対象の列だけを見たいとき
df_human2['age']

sato      23
suzuki    49
tanaka    60
yamada    31
Name: age, dtype: int64

In [22]:
#対象の列を複数列で見たいとき
df_human2[['age', 'height']]

        age  height
sato     23   175.0
suzuki   49     NaN
tanaka   60   180.0
yamada   31   156.0

### locアトリビュートを使ったでーたの抽出について
### 列ではなく対象行の列の情報を確認したいときに使う

In [23]:
#locアトリビュートは特定の行を参照たい場合に使う

df_human2.loc['suzuki']

age        49
gender      M
height    NaN
weight    NaN
Name: suzuki, dtype: object

In [25]:
#locアトリビュートは行名と列名を両方指定してデータを抽出することもできる

df_human2.loc['suzuki', 'age']

49

In [26]:
#locはスライスも使うことができる

df_human2.loc['suzuki':'yamada', 'age']

suzuki    49
tanaka    60
yamada    31
Name: age, dtype: int64

In [28]:
#対象行の全データを抽出したいときはコロンを使って抽出することができる
#コロン使わなくても行のインデックス名を指定してあげるだけでも大丈夫
df_human2.loc['suzuki', :]

age        49
gender      M
height    NaN
weight    NaN
Name: suzuki, dtype: object

### ilocアトリビュートを使ったデータの参照
### locではラベル名で指定していたが、ilocではindexの番号で指定する

In [29]:
#


#データフレームの参照について


#新たにseriesをデータフレームにするためのやつを作っておく
sr_age3 = pd.Series([23, 31, 49, 60], index=['sato', 'yamada', 'suzuki', 'tanaka'])
sr_gender3 = pd.Series(['M', 'F', 'M'], index=['sato', 'yamada', 'suzuki'])
sr_height3 = pd.Series([175, 156, 180], index=['sato', 'yamada', 'tanaka'])
sr_weight3 = pd.Series([65, 40], index=['sato', 'tanaka'])

In [30]:
#左にはつけたいカラム名で右に対象とするデータを指定してあげる
df_human3 = pd.DataFrame({
    'age' : sr_age3,
    'gender' : sr_gender3,
    'height' : sr_height3,
    'weight' : sr_weight3
})

display(df_human3)
#indexが人の名前になっている
#データのない部分は欠損値になっている

        age gender  height  weight
sato     23      M   175.0    65.0
suzuki   49      M     NaN     NaN
tanaka   60    NaN   180.0    40.0
yamada   31      F   156.0     NaN

In [32]:
#satoさんの身長のデータを抽出したいとき
df_human3.iloc[0, 2]

175.0

In [33]:
#スライスを使ってやる
#satoさんからtanakaさんまでの身長データを抽出する
df_human3.iloc[0:3, 2]

sato      175.0
suzuki      NaN
tanaka    180.0
Name: height, dtype: float64

In [36]:
#対象行の全データを抽出したいとき
df_human3.iloc[0, :]

age          23
gender        M
height    175.0
weight     65.0
Name: sato, dtype: object

### データフレームの条件抽出

In [37]:
df_human3[df_human3['height'] > 170]

        age gender  height  weight
sato     23      M   175.0    65.0
tanaka   60    NaN   180.0    40.0

In [38]:
df_human3[df_human3['gender'] == 'M']

        age gender  height  weight
sato     23      M   175.0    65.0
suzuki   49      M     NaN     NaN

In [41]:
#データフレームの先頭だけ見たいとき
df_human3.head(1)

      age gender  height  weight
sato   23      M   175.0    65.0

In [42]:
#データフレームの最後らへんだけ見たいとき
df_human3.tail(1)

        age gender  height  weight
yamada   31      F   156.0     NaN

### データフレームの要素の変更について

In [43]:
#


#データフレームの参照について


#新たにseriesをデータフレームにするためのやつを作っておく
sr_age4 = pd.Series([23, 31, 49, 60], index=['sato', 'yamada', 'suzuki', 'tanaka'])
sr_gender4 = pd.Series(['M', 'F', 'M'], index=['sato', 'yamada', 'suzuki'])
sr_height4 = pd.Series([175, 156, 180], index=['sato', 'yamada', 'tanaka'])
sr_weight4 = pd.Series([65, 40], index=['sato', 'tanaka'])

In [48]:
#左にはつけたいカラム名で右に対象とするデータを指定してあげる
df_human4 = pd.DataFrame({
    'age' : sr_age4,
    'gender' : sr_gender4,
    'height' : sr_height4,
    'weight' : sr_weight4
})

display(df_human4)
#indexが人の名前になっている
#データのない部分は欠損値になっている

        age gender  height  weight
sato     23      M   175.0    65.0
suzuki   49      M     NaN     NaN
tanaka   60    NaN   180.0    40.0
yamada   31      F   156.0     NaN

In [49]:
#内容の変更
df_human4['height'] = 175

In [46]:
df_human4

        age gender  height  weight
sato     23      M     175    65.0
suzuki   49      M     175     NaN
tanaka   60    NaN     175    40.0
yamada   31      F     175     NaN

In [50]:
#locアトリビュートを使った処理
#特定の行の特定の列の修正
#度の行の何の列を何に変えたいのか
df_human4.loc['suzuki','age'] = 100
display(df_human4)

        age gender  height  weight
sato     23      M     175    65.0
suzuki  100      M     175     NaN
tanaka   60    NaN     175    40.0
yamada   31      F     175     NaN

In [51]:
#ilocアトリビュートを使った処理
#satoさんの行をすべて30へ変更する
df_human4.iloc[0] = 30
display(df_human4)

        age gender  height  weight
sato     30     30      30    30.0
suzuki  100      M     175     NaN
tanaka   60    NaN     175    40.0
yamada   31      F     175     NaN

#satoさんのgenderをMへ変更する
df_human4.iloc[0, 1] = 'M'
display(df_human4)

In [53]:
#satoさんのgenderをMへ変更する
df_human4.iloc[0, 1] = 'M'
display(df_human4)

        age gender  height  weight
sato     30      M      30    30.0
suzuki  100      M     175     NaN
tanaka   60    NaN     175    40.0
yamada   31      F     175     NaN

### データフレームの列と行の追加

In [55]:
df_human4['nuw_columns'] = 'あああ'

#行の追加はlocアトリビュートを使わないとできない
df_human4.loc['new_index'] = 0

display(df_human4)

           age gender  height  weight nuw_columns
sato        30      M      30    30.0         あああ
suzuki     100      M     175     NaN         あああ
tanaka      60    NaN     175    40.0         あああ
yamada      31      F     175     NaN         あああ
new_index    0      0       0     0.0           0

In [58]:
display(df_human4)

           age gender  height  weight nuw_columns
sato        30      M      30    30.0         あああ
suzuki     100      M     175     NaN         あああ
tanaka      60    NaN     175    40.0         あああ
yamada      31      F     175     NaN         あああ
new_index    0      0       0     0.0           0

#### 列の削除

In [65]:
#axis=1は列を消す命令
#labelsで消したい列の項目の項目を指定する

#inplaceのパラメータでデータフレームへの変更を反映させる
df_human4.drop(labels='nuw_columns', axis=1,inplace=True)
display(df_human4)

KeyError: "['nuw_columns'] not found in axis"

In [66]:
display(df_human4)

           height  weight
sato           30    30.0
suzuki        175     NaN
tanaka        175    40.0
yamada        175     NaN
new_index       0     0.0

In [64]:
#複数の列を削除するとき

df_human4.drop(labels=['age','gender'], axis=1, inplace=True)
display(df_human4)

KeyError: "['age' 'gender'] not found in axis"

In [67]:
display(df_human4)

           height  weight
sato           30    30.0
suzuki        175     NaN
tanaka        175    40.0
yamada        175     NaN
new_index       0     0.0

In [68]:
#データフレームの再定義


#データフレームの参照について


#新たにseriesをデータフレームにするためのやつを作っておく
sr_age5 = pd.Series([23, 31, 49, 60], index=['sato', 'yamada', 'suzuki', 'tanaka'])
sr_gender5 = pd.Series(['M', 'F', 'M'], index=['sato', 'yamada', 'suzuki'])
sr_height5 = pd.Series([175, 156, 180], index=['sato', 'yamada', 'tanaka'])
sr_weight5 = pd.Series([65, 40], index=['sato', 'tanaka'])

In [69]:
#左にはつけたいカラム名で右に対象とするデータを指定してあげる
df_human5 = pd.DataFrame({
    'age' : sr_age5,
    'gender' : sr_gender5,
    'height' : sr_height5,
    'weight' : sr_weight5
})

display(df_human5)
#indexが人の名前になっている
#データのない部分は欠損値になっている

        age gender  height  weight
sato     23      M   175.0    65.0
suzuki   49      M     NaN     NaN
tanaka   60    NaN   180.0    40.0
yamada   31      F   156.0     NaN

In [70]:
#axis=0は行を消す命令
#labelsで消したい行の項目を指定する

df_human5.drop(labels=['sato', 'suzuki'], axis=0, inplace=True)
display(df_human5)

        age gender  height  weight
tanaka   60    NaN   180.0    40.0
yamada   31      F   156.0     NaN